Repository: PlanejaSafra/PlanejaCampo
Catalog: packages/agro_core/lib/l10n/arb/app_*.arb
Languages: pt

# alertStormMessage
source: Heavy rain or strong winds forecast.
pt: Previsão de chuva forte ou ventos intensos.

# alertDroughtTitle
source: Drought Alert
pt: Alerta de Estiagem

# alertDroughtMessage
source: No significant rain forecast for the next 7 days.
pt: Sem previsão significativa de chuva para os próximos 7 dias.

# alertHighWindTitle
source: High Winds
pt: Ventos Fortes

# alertHighWindMessage
source: Wind gusts above 45km/h expected.
pt: Rajadas de vento acima de 45km/h previstas.

# alertHailTitle
source: Hail Alert
pt: Alerta de Granizo

# alertHailMessage
source: Thunderstorm with hail forecast. Protect vehicles and structures.
pt: Tempestade com granizo prevista. Proteja veículos e estruturas.

# alertsSectionTitle
source: Weather Alerts
pt: Alertas Meteorológicos

# migrationTitle
source: Account already exists
pt: Conta já existe

# migrationMessage
source: This Google account already has data. Do you want to transfer your current records to it?
pt: Esta conta Google já possui dados. Deseja transferir seus registros atuais para ela?

# migrationTransfer
source: Transfer Data
pt: Transferir Dados

# migrationCancel
source: Cancel
pt: Cancelar

# migrationProgress
source: Migrating data...
pt: Migrando dados...

# migrationProgressProperties
source: Transferring properties...
pt: Transferindo propriedades...

# migrationProgressTalhoes
source: Transferring field plots...
pt: Transferindo talhões...

# migrationProgressRecords
source: Transferring records...
pt: Transferindo registros...

# migrationSuccess
source: Migration completed successfully!
pt: Migração concluída com sucesso!

# migrationError
source: Error during migration. Your original data has been preserved.
pt: Erro durante migração. Seus dados originais foram preservados.

# weatherClearSky
source: Clear sky
pt: Céu limpo

# weatherPartlyCloudy
source: Partly cloudy
pt: Parcialmente nublado

# weatherFog
source: Fog
pt: Neblina

# weatherLightRain
source: Light rain
pt: Chuva fraca

# weatherShowers
source: Rain showers
pt: Pancadas de chuva

# weatherThunderstorm
source: Thunderstorm
pt: Tempestade

# weatherCloudy
source: Cloudy
pt: Nublado

# weatherForecastFor
source: Forecast for: {propertyName}
pt: Previsão para: {propertyName}

source: Weather Now
pt: Tempo Agora

# weatherSeeDetails
source: See Details
pt: Ver Detalhes

# weatherLocationRequired
source: Location Required
pt: Localização Necessária

# weatherLocationRequiredDesc
source: Tap here if you're at the property to enable the forecast.
pt: Toque aqui se estiver na propriedade para ativar a previsão.

# weatherConsentRequired
source: Consent Required
pt: Consentimento Necessário

# weatherConsentRequiredDesc
source: Tap to authorize location usage and see the forecast.
pt: Toque para autorizar o uso de localização e ver a previsão.

# weatherActivateForecast
source: Activate Weather Forecast
pt: Ativar Previsão do Tempo

# weatherActivateForecastMessage
source: To show the correct forecast, we need this property's location. Are you at the property now?
pt: Para mostrar a previsão correta, precisamos da localização desta propriedade. Você está na propriedade agora?

# weatherNotHere
source: No, I'm far away
pt: Não, estou longe

# weatherYesHere
source: Yes, I'm here
pt: Sim, estou aqui

# weatherSetLocation
source: Set Location
pt: Definir Localização

# weatherSetLocationMessage
source: No problem. Would you prefer to set the coordinates manually now or later?
pt: Sem problemas. Você prefere definir as coordenadas manualmente agora ou deixar para depois?

# weatherLater
source: Later
pt: Depois

# weatherSetManually
source: Set Manually
pt: Definir Manualmente

# weatherErrorServiceDisabled
source: Location service disabled.
pt: Serviço de localização desativado.

# weatherErrorPermissionDenied
source: Location permission denied.
pt: Permissão de localização negada.

# weatherErrorPermissionDeniedForever
source: Permission permanently denied. Enable in settings.
pt: Permissão negada permanentemente. Habilite nas configurações.

# weatherLocationUpdated
source: Location updated! Loading forecast...
pt: Localização atualizada! Carregando previsão...

# weatherErrorGettingLocation
source: Error getting location: {error}
pt: Erro ao obter localização: {error}

# settingsTheme
source: Theme
pt: Tema

# settingsThemeAuto
source: Auto
pt: Automático

# settingsThemeLight
source: Light
pt: Claro

# settingsThemeDark
source: Dark
pt: Escuro

# settingsThemeFollowsSystem
source: Follows system
pt: Segue o sistema

# settingsNotifications
source: Notifications
pt: Notificações

# settingsDailyReminder
source: Daily Reminder
pt: Lembrete Diário

# settingsReminderDailyAt
source: Daily at {time}
pt: Diariamente às {time}

# settingsReminderDisabled
source: Disabled
pt: Desativado

# settingsReminderTime
source: Time
pt: Horário

# backupCloudSection
source: Cloud Backup
pt: Backup na Nuvem

# backupCloudDescription
source: Securely sync your data with your Google account
pt: Sincronize seus dados de forma segura com sua conta Google

# backupCloudNow
source: Backup Now
pt: Salvar Agora

# backupCloudLastBackup
source: Last backup: {date}
pt: Último backup: {date}

# backupCloudNeverDone
source: No backup yet
pt: Nenhum backup realizado

# backupCloudRestore
source: Restore from Cloud
pt: Restaurar

# backupCloudRestoreDesc
source: Replaces local data with backup
pt: Substitui dados locais pelo backup

# backupCloudSuccess
source: Backup completed successfully!
pt: Backup realizado com sucesso!

# backupCloudRestoreSuccess
source: Data restored successfully!
pt: Dados restaurados com sucesso!

# backupCloudError
source: Backup error: {error}
pt: Erro no backup: {error}

# backupCloudRestoreError
source: Restore error: {error}
pt: Erro na restauração: {error}

# backupCloudSignInRequired
source: Sign in with Google to use cloud backup
pt: Entre com Google para usar o backup na nuvem

# backupCloudSignInButton
source: Sign in with Google
pt: Entrar com Google

# backupCloudAnonymousWarning
source: Create a Google account to save your data to the cloud
pt: Crie uma conta Google para salvar seus dados na nuvem

# loginBenefitSync
source: Sync & Backup (If enabled)
pt: Sincronização e Backup (Se você ativar)

# loginBenefitSocial
source: Business Network (If enabled)
pt: Acesso à Rede de Negócios (Se você ativar)

# loginBenefitSecurity
source: Total privacy by default (you control what you share)
pt: Privacidade total por padrão (você controla o que compartilha)

# backupLocalSection
source: Local Backup
pt: Backup Local

# backupLocalExport
source: Export to File
pt: Exportar para Arquivo

# backupLocalExportDesc
source: Save data to your device
pt: Salva dados no seu dispositivo

# backupLocalImport
source: Import from File
pt: Importar de Arquivo

# backupLocalImportDesc
source: Restore from a local file
pt: Restaura de um arquivo local

# settingsPrivacyData
source: Privacy & Data
pt: Privacidade e Dados

# settingsManageConsents
source: Manage Consents
pt: Gerenciar Consentimentos

# settingsSyncPrefs
source: Sync Preferences
pt: Sincronizar Preferências

# settingsSyncPrefsDesc
source: Theme and basic settings
pt: Tema e configurações básicas

# settingsExportMyData
source: Export My Data
pt: Exportar Meus Dados

# settingsExportMyDataDesc
source: LGPD/GDPR - Data portability
pt: LGPD/GDPR - Portabilidade

# settingsDeleteCloudData
source: Delete Cloud Data
pt: Deletar Dados da Nuvem

# settingsDeleteCloudDataDesc
source: Keeps local data
pt: Mantém dados locais

# rainNoRainNextHour
source: No rain in the next hour
pt: Sem chuva na próxima hora

# rainRainingNow
source: Raining now
pt: Chovendo agora

# rainStartingIn15
source: Rain starting in ~15 min
pt: Chuva começa em ~15 min

# rainStartingIn30
source: Rain starting in ~30 min
pt: Chuva começa em ~30 min

# rainStartingIn45
source: Rain starting in ~45 min
pt: Chuva começa em ~45 min

# rainNextHour
source: Rain in the next hour
pt: Chuva na próxima hora

# settingsRainAlerts
source: Rain Alerts
pt: Alertas de Chuva

# settingsRainAlertsDesc
source: Get notified before it rains
pt: Receba avisos antes de chover

# notificationRainTitle
source: Rain starting soon!
pt: Vai chover em breve!

# notificationRainBody
source: Rain expected to start in {minutes} min.
pt: Chuva prevista para começar em {minutes} min.

# notificationRainBodyWithProperty
source: Rain expected in {minutes} min at {propertyName}.
pt: Chuva prevista para começar em {minutes} min na {propertyName}.

# notificationChannelName
source: Rain Alerts
pt: Alertas de Chuva

# notificationChannelDesc
source: Notifies when heavy rain is approaching
pt: Notifica quando chuvas fortes estão próximas

source: Notification permission required
pt: Permissão de notificação necessária

# heatmapTitle
source: Rain Heatmap
pt: Mapa de Calor

# heatmapLegendLight
source: Light
pt: Leve

# heatmapLegendModerate
source: Moderate
pt: Moderada

# heatmapLegendHeavy
source: Heavy
pt: Intensa

# heatmapNoData
source: Insufficient data for this region
pt: Sem dados suficientes para esta região

# drawerHeatmap
source: Weather Map
pt: Mapa do Tempo

# mapLayerRadar
source: Radar (Real-time)
pt: Radar (Tempo Real)

# mapLayerCommunity
source: Community (Heat)
pt: Comunidade (Calor)

# radarAttribution
source: Radar Data by RainViewer
pt: Dados de Radar por RainViewer

# radarPast
source: Past ({time})
pt: Passado ({time})

# radarPresent
source: Now
pt: Agora

# radarFuture
source: Future ({time})
pt: Futuro ({time})

# radarSpeed
source: Speed
pt: Velocidade

# radarLoading
source: Loading Radar...
pt: Carregando Radar...

# radarError
source: Error loading radar
pt: Erro ao carregar radar

# cancelButton
source: Cancel
pt: Cancelar

# deleteButton
source: Delete
pt: Excluir

# deleteCloudDataTitle
source: Delete cloud data?
pt: Excluir dados da nuvem?

# deleteCloudDataMessage
source: This will remove your synced data from the cloud. Local data on your device will be kept. You can sync again in the future if you wish.
pt: Esta ação irá remover seus dados sincronizados na nuvem. Os dados locais no seu dispositivo serão mantidos. Você poderá sincronizar novamente no futuro se desejar.

# deleteCloudDataSuccess
source: Cloud data deleted successfully
pt: Dados da nuvem excluídos com sucesso

# settingsResetProfile
source: Switch Profile
pt: Trocar Perfil

# settingsResetProfileDesc
source: Return to Producer/Tapper/Buyer selection
pt: Voltar para a seleção de Produtor/Sangrador/Comprador

# radarRainMode
source: Rain Mode
pt: Modo Chuva

# radarSnowMode
source: Snow Mode
pt: Modo Neve

# radarRainIntensity
source: Rain Intensity
pt: Intensidade da Chuva

# radarSnowIntensity
source: Snow Intensity
pt: Intensidade da Neve

# mapTypeSatellite
source: Satellite
pt: Satélite

# mapTypeNormal
source: Road Map
pt: Mapa de Estrada

# weatherForecastTitle
source: Weather Forecast
pt: Previsão do Tempo

# weatherForecastUpdated
source: Forecast updated successfully
pt: Previsão atualizada com sucesso

# tryAgainButton
source: Try again
pt: Tentar novamente

# loadForecastButton
source: Load forecast
pt: Carregar previsão

# goToSettingsButton
source: Go to Settings
pt: Ir para Configurações

# checkAgainButton
source: Check again
pt: Verificar novamente

# useCurrentGpsButton
source: Use Current GPS
pt: Usar GPS Atual

# selectOnMapButton
source: Select on Map
pt: Selecionar no Mapa

# manageTalhoesButton
source: Manage Field Plots
pt: Gerenciar Talhões

# regionalStatsTitle
source: Regional Statistics
pt: Estatísticas Regionais

# configurePropertyFirst
source: Configure a property with location first
pt: Configure uma propriedade com localização primeiro

# exportJsonSubtitle
source: Complete format with all metadata
pt: Formato completo com todos os metadados

# exportCsvSubtitle
source: Compatible with Excel and Google Sheets
pt: Compatível com Excel e Google Sheets

# exportJsonOrCsv
source: JSON or CSV for use in other apps
pt: JSON ou CSV para uso em outros apps

source: Deleting data...
pt: Excluindo dados...

# errorPrefix
source: Error
pt: Erro

# errorLogin
source: Login error
pt: Erro ao fazer login

# errorExport
source: Export error
pt: Erro ao exportar

# errorImport
source: Import error
pt: Erro ao importar

# errorSave
source: Save error
pt: Erro ao salvar

# errorLoadProperties
source: Error loading properties
pt: Erro ao carregar propriedades

source: Error getting GPS
pt: Erro ao obter GPS

# filterLocationTitle
source: Location Filter
pt: Filtro de Localização

# notificationsComingSoon
source: Offer notifications coming soon!
pt: Notificações de ofertas em desenvolvimento. Volte em breve!

# receiptTitle
source: Weighing Receipt
pt: Recibo de Pesagem

# generatedByApp
source: Generated automatically by app
pt: Gerado automaticamente pelo app

# lgpdRightsTitle
source: Your Rights (LGPD/GDPR)
pt: Seus Direitos (LGPD)

# lgpdRightsDescription
source: Exercise your data portability and deletion rights.
pt: Exerça seus direitos de portabilidade e eliminação de dados.

# deleteDataSubtitle
source: Removes data from device and servers
pt: Remove dados do dispositivo e servidores

# revokeConsentsSubtitle
source: Revokes consents and ends session
pt: Revoga consentimentos e encerra sessão

# backupImportResult
source: Imported: {imported}, Duplicates: {duplicates}
pt: Importados: {imported}, Duplicados: {duplicates}

# backupLocalExportSuccess
source: Local backup exported successfully
pt: Backup local exportado com sucesso

# autoBackupTitle
source: Automatic backup
pt: Backup automático

# autoBackupSubtitle
source: Backup when opening the app
pt: Realizado periodicamente
