Repository: PlanejaSafra/PlanejaCampo
Catalog: packages/agro_core/lib/l10n/arb/app_*.arb
Languages: pt

# consentOption2Desc
source: Enables viewing vacancies and offers (Digital Showcase).
pt: Habilita visualização de vagas e ofertas (Vitrine Digital).

# consentOption2Legal
source: This option activates social features (Market, Jobs, Classifieds, etc.) and is available for both guests and logged-in users. By activating, you authorize the sending, storage, processing, and sharing of your data — including, but not limited to, profile information, contact details, location, and ad content — as necessary for the operation of the platform and its partners. The app is merely a connection facilitator.
pt: Esta opção ativa as funções sociais (Mercado, Vagas, Classificados, entre outras) e está disponível tanto para visitantes quanto para usuários logados. Ao ativar, você autoriza o envio, armazenamento, processamento e compartilhamento dos seus dados — incluindo, mas não se limitando a, informações de perfil, contato, localização e conteúdo de anúncios — conforme necessário para o funcionamento da plataforma e de seus parceiros. O aplicativo é apenas um facilitador de conexões.

# consentOptionSocialLearnMore
source: Enables the DIGITAL BUSINESS ECOSYSTEM. The app is a CONNECTION PLATFORM and does not guarantee transactions. TOTAL LIABILITY WAIVER: 1. PHYSICAL SECURITY: We are not responsible for assaults, accidents, or crimes occurring in face-to-face meetings; 2. FINANCIAL AND DIGITAL SECURITY: We are not responsible for bank transactions, PIX, non-payment, fraud, digital scams, or phishing occurring inside or outside the platform; 3. LABOR RELATIONS: We do not check links or backgrounds. The responsibility for any financial transaction or hiring is 100% YOURS.
pt: Habilita o ECOSSISTEMA DIGITAL DE NEGÓCIOS. O app é uma PLATAFORMA DE CONEXÃO e não garante transações. ISENÇÃO TOTAL DE RESPONSABILIDADE: 1. SEGURANÇA FÍSICA: Não nos responsabilizamos por agressões, acidentes ou crimes ocorridos em encontros presenciais; 2. SEGURANÇA FINANCEIRA E DIGITAL: Não nos responsabilizamos por transações bancárias, PIX, não pagamento, fraudes, golpes digitais ou phishing ocorridos dentro ou fora da plataforma; 3. RELAÇÕES TRABALHISTAS: Não verificamos vínculos nem antecedentes. A responsabilidade por qualquer transação financeira ou contratação é 100% SUA.

# safetyWarningMessage
source: SAFETY TIP: When scheduling in-person visits, check the person's references and let a family member know. PlanejaCampo does not check users' criminal backgrounds.
pt: DICA DE SEGURANÇA: Ao marcar visitas presenciais, verifique as referências da pessoa e avise um familiar. O RuraCamp não verifica antecedentes criminais dos usuários.

# consentOption3Title
source: Agronomic & Market Intelligence
pt: Inteligência Agronômica e de Mercado

# consentOption3Desc
source: Enables maps, price averages, and advanced technical suggestion tools (fertilization, management, weather).
pt: Habilita mapas, médias de preços e ferramentas avançadas de sugestão técnica (adubação, manejo, clima).

# consentOption3Legal
source: This option unlocks collective intelligence features and is available for both guests and logged-in users. By activating, you authorize the sending, storage, processing, aggregation, analysis, and sharing of your data — including, but not limited to, production data, weather, location, and operations — in identified, anonymized, or aggregated form, for market intelligence, research, commercial partnerships, and service improvement purposes. Without this permission, you will not have access to regional maps and metrics.
pt: Esta opção desbloqueia as funcionalidades de inteligência coletiva e está disponível tanto para visitantes quanto para usuários logados. Ao ativar, você autoriza o envio, armazenamento, processamento, agregação, análise e compartilhamento dos seus dados — incluindo, mas não se limitando a, dados de produção, clima, localização e operações — de forma identificada, anonimizada ou agregada, para fins de inteligência de mercado, pesquisa, parcerias comerciais e melhoria dos serviços. Sem esta permissão, você não terá acesso aos mapas e métricas regionais.

# consentOptionIntelligenceLearnMore
source: This unlocks collective intelligence features and decision support tools. In exchange, your anonymized data composes our base. TOTAL TECHNICAL AND AGRONOMIC LIABILITY WAIVER: All management suggestions, fertilization/liming calculations, pesticide indications, crop forecasts, or diagnoses generated by the system are SIMULATIONS based on mathematical and statistical algorithms. The app does NOT replace face-to-face consulting or the issuance of an Agronomic Prescription by a qualified Agronomist, as required by law. The app is NOT liable for: 1. Dosing errors, phytotoxicity, or product inefficiency; 2. Environmental damage, soil/water contamination, or crop death; 3. Chemical incompatibility of mixtures; 4. Losses due to pests, diseases, or unforeseen weather. The decision to apply any input or technique is the sole and exclusive responsibility of the user, who assumes all technical, environmental, and financial risks.
pt: Esta opção desbloqueia as funcionalidades de inteligência coletiva e ferramentas de suporte à decisão. Em troca, seus dados anonimizados compõem nossa base. ISENÇÃO TOTAL DE RESPONSABILIDADE TÉCNICA E AGRONÔMICA: Todas as sugestões de manejo, cálculos de adubação/calagem, indicações de defensivos, previsões de safra ou diagnósticos gerados pelo sistema são SIMULAÇÕES baseadas em algoritmos matemáticos e estatísticos. O aplicativo NÃO substitui a consultoria presencial nem a emissão de Receituário Agronômico por Engenheiro Agrônomo habilitado, conforme exigido por lei. O aplicativo NÃO se responsabiliza por: 1. Erros de dosagem, fitotoxicidade ou ineficiência de produtos; 2. Danos ambientais, contaminação de solo/água ou morte de culturas; 3. Incompatibilidade química de misturas; 4. Prejuízos decorrentes de pragas, doenças ou intempéries não previstas. A decisão de aplicar qualquer insumo ou técnica é de inteira e exclusiva responsabilidade do usuário, que assume todos os riscos técnicos, ambientais e financeiros.

# consentSmallNoteUnderDecline
source: Without accepting, you can use the app normally in private mode (basic offline features).
pt: Sem aceitar, você pode usar o app normalmente no modo privado (funções básicas offline).

# identityTitle
source: Welcome to PlanejaCampo
pt: Bem-vindo ao RuraCamp

# identitySlogan
source: Manage your farm intelligently
pt: Gerencie sua fazenda de forma inteligente

# identityGoogleButton
source: Sign in with Google
pt: Entrar com Google

# identityAnonymousButton
source: Continue as Guest
pt: Continuar como Visitante

# identityFooterLegal
source: Your data is private by default. We do not sell personally identifiable data. The use of data for market statistics and partnerships occurs only with your authorization in Intelligence modules.
pt: Seus dados são privados por padrão. Não vendemos dados pessoais identificáveis. O uso de dados para estatísticas de mercado e parcerias ocorre apenas mediante sua autorização nos módulos de Inteligência.

# identityTermsLink
source: Terms of Use
pt: Termos de Uso

# identityPrivacyLink
source: Privacy Policy
pt: Política de Privacidade

# consentFooterPrefix
source: You can review our
pt: Você pode revisar nossos

# consentFooterConnector
source: and
pt: e

# consentFooterSuffix
source: at any time.
pt: a qualquer momento.

# identityNoInternetTitle
source: No Internet
pt: Sem Internet

# identityNoInternetMessage
source: For the first access, we need internet to set up your secure account. Please connect and try again.
pt: Para o primeiro acesso, precisamos de internet para configurar sua conta segura. Por favor, conecte-se e tente novamente.

# identityTryAgain
source: Try Again
pt: Tentar Novamente

# identityErrorTitle
source: Sign In Error
pt: Erro ao Entrar

# identityErrorGoogleCanceled
source: You canceled Google sign in.
pt: Você cancelou o login com Google.

# identityErrorGoogleFailed
source: Failed to sign in with Google. Try again or use Guest.
pt: Falha ao entrar com Google. Tente novamente ou use Visitante.

# identityErrorAnonymousFailed
source: Failed to create guest account. Check your connection.
pt: Falha ao criar conta visitante. Verifique sua conexão.

# drawerHome
source: Home
pt: Início

# drawerProperties
source: Properties
pt: Propriedades

# drawerSettings
source: Settings
pt: Configurações

# drawerPrivacy
source: Privacy and Consents
pt: Privacidade e Consentimentos

# drawerAbout
source: About
pt: Sobre

# settingsTitle
source: Settings
pt: Configurações

# settingsLanguage
source: Language
pt: Idioma

# settingsLanguageAuto
source: Automatic
pt: Automático

# settingsAboutApp
source: About the App
pt: Sobre o App

# settingsPropertiesAndTalhoes
source: Properties & Field Plots
pt: Propriedades e Talhões

# settingsPropertiesAndTalhoesDesc
source: Manage your production sites
pt: Gerencie seus locais de produção

# settingsManagement
source: Management
pt: Gerenciamento

# aboutTitle
source: About
pt: Sobre

# aboutDescription
source: This app is part of the PlanejaCampo Suite, designed to help rural producers manage their activities in the field.
pt: Este app faz parte da suíte RuraCamp, projetada para ajudar produtores rurais a gerenciar suas atividades no campo.

# aboutOfflineFirst
source: Offline-First by default: your data stays on the device. Optional features may sync with the cloud.
pt: Offline-First por padrão: seus dados ficam no dispositivo. Funcionalidades opcionais podem sincronizar com a nuvem.

# aboutSuite
source: PlanejaCampo Suite
pt: Suíte RuraCamp

# aboutVersion
source: Version
pt: Versão

# privacyTitle
source: Privacy and Consents
pt: Privacidade e Consentimentos

# privacyTermsSection
source: Terms of Use and Privacy Policy
pt: Termos de Uso e Política de Privacidade

# privacyTermsSummary
source: By using this app, you agree to our Terms of Use and Privacy Policy. You can review the full documents at any time.
pt: Ao usar este app, você concorda com nossos Termos de Uso e Política de Privacidade. Você pode consultar os documentos completos a qualquer momento.

# privacyConsentsSection
source: Data Sharing Consents
pt: Consentimentos de Compartilhamento

# privacyConsentsDescription
source: Manage how your data can be used. All options are optional.
pt: Gerencie como seus dados podem ser usados. Todas as opções são opcionais.

# consentShareAggregated
source: Data and Location
pt: Dados e Localização

# consentReceiveRegionalMetrics
source: Offers and Promotions
pt: Ofertas e Promoções

# consentPersonalizedAds
source: Personalized Ads
pt: Anúncios Personalizados

# privacySaved
source: Preferences saved
pt: Preferências salvas

# propertyDefaultName
source: My Property
pt: Minha Propriedade

# propertyTitle
source: Properties
pt: Propriedades

# propertyAdd
source: Add Property
pt: Adicionar Propriedade

# propertyEdit
source: Edit Property
pt: Editar Propriedade

# propertyName
source: Name
pt: Nome

# propertyNameHint
source: E.g.: Primavera Farm
pt: Ex: Fazenda Primavera

# propertyTotalArea
source: Total Area (ha)
pt: Área Total (ha)

# propertyTotalAreaHint
source: E.g.: 150.5
pt: Ex: 150.5

# propertyLocation
source: Location
pt: Localização

# propertyLocationDesc
source: Used for regional statistics and weather forecast (optional)
pt: Usado para estatísticas regionais e previsão do tempo (opcional)

# propertyUseCurrentLocation
source: Use my location
pt: Usar minha localização

# propertySetAsDefault
source: Set as default
pt: Definir como padrão

# propertyIsDefault
source: Default property
pt: Propriedade padrão

# propertyDefaultBadge
source: Default
pt: Padrão

# propertyDelete
source: Delete Property
pt: Excluir Propriedade

# propertyDeleteConfirm
source: Are you sure you want to delete this property?
pt: Tem certeza que deseja excluir esta propriedade?

# propertyDeleteWithRecords
source: This property has linked records. When deleted, all records will be moved to the default property.
pt: Esta propriedade possui registros vinculados. Ao excluir, todos os registros serão movidos para a propriedade padrão.

source: Property deleted
pt: Propriedade excluída

# propertyCannotDeleteDefault
source: Cannot delete the default property. Set another property as default first.
pt: Não é possível excluir a propriedade padrão. Defina outra propriedade como padrão primeiro.

# propertyCannotDeleteLast
source: Cannot delete the only property. Create another property first.
pt: Não é possível excluir a única propriedade. Crie outra propriedade primeiro.

# propertyNoProperties
source: No properties registered
pt: Nenhuma propriedade cadastrada

# propertyNoPropertiesDesc
source: Tap + to add your first property
pt: Toque no + para adicionar sua primeira propriedade

# propertyChangeProperty
source: Change
pt: Trocar

# propertySelectProperty
source: Select Property
pt: Selecionar Propriedade

# propertyAllProperties
source: All
pt: Todas

# propertyFilterBy
source: Filter by property
pt: Filtrar por propriedade

# propertyFirstTimeTip
source: 💡 Tip: You can manage properties in Settings
pt: 💡 Dica: Você pode gerenciar propriedades em Configurações

source: Property saved!
pt: Propriedade salva!

source: Property updated!
pt: Propriedade atualizada!

# propertyNameRequired
source: Enter property name
pt: Digite o nome da propriedade

# propertyNameTooShort
source: Name too short (minimum 2 characters)
pt: Nome muito curto (mínimo 2 caracteres)

# propertyNameExists
source: A property with this name already exists
pt: Já existe uma propriedade com este nome

# propertyAreaInvalid
source: Area must be greater than zero
pt: Área deve ser maior que zero

# propertyLocationPermissionDenied
source: Location permission denied
pt: Permissão de localização negada

# propertyLocationUnavailable
source: Could not get your location
pt: Não foi possível obter sua localização

# chuvaAppTitle
source: Planeja Chuva
pt: RuraRain

# chuvaListaVaziaTitle
source: No rainfall recorded
pt: Nenhuma chuva registrada

# chuvaListaVaziaSubtitle
source: Tap + to record your first rainfall
pt: Toque no + para registrar sua primeira chuva

# chuvaAdicionarTitle
source: Record Rainfall
pt: Registrar Chuva

# chuvaEditarTitle
source: Edit Record
pt: Editar Registro

# chuvaCampoMilimetros
source: Millimeters (mm)
pt: Milímetros (mm)

# chuvaCampoMilimetrosHint
source: E.g.: 25.5
pt: Ex: 25.5

# chuvaCampoData
source: Date
pt: Data

# chuvaCampoObservacao
source: Note (optional)
pt: Observação (opcional)

# chuvaCampoObservacaoHint
source: E.g.: Heavy rain in the afternoon
pt: Ex: Chuva forte à tarde

# chuvaBotaoSalvar
source: SAVE
pt: SALVAR

# chuvaBotaoCancelar
source: CANCEL
pt: CANCELAR

# chuvaBotaoExcluir
source: DELETE
pt: EXCLUIR

# chuvaConfirmarExclusaoTitle
source: Delete record?
pt: Excluir registro?

# chuvaConfirmarExclusaoMsg
source: Are you sure you want to delete this rainfall record?
pt: Tem certeza que deseja excluir este registro de chuva?

# chuvaRegistrada
source: Rainfall of {mm}mm recorded!
pt: Chuva de {mm}mm registrada!

# chuvaAtualizada
source: Record updated!
pt: Registro atualizado!

# chuvaExcluida
source: Record deleted
pt: Registro excluído

# chuvaDesfazer
source: UNDO
pt: DESFAZER

# chuvaTotalDoMes
source: Month total
pt: Total do mês

# chuvaMesAnterior
source: Previous month
pt: Mês anterior

# chuvaEstatisticas
source: Statistics
pt: Estatísticas

# chuvaEstatisticasTitle
source: Rainfall Statistics
pt: Estatísticas de Chuva

# chuvaTotalAno
source: Year total
pt: Total do ano

# chuvaMediaPorChuva
source: Average per rain
pt: Média por chuva

# chuvaMaiorRegistro
source: Highest record
pt: Maior registro

# chuvaTotalRegistros
source: Total records
pt: Total de registros

# chuvaBackupTitle
source: Data Backup
pt: Backup de Dados

# chuvaExportarDados
source: Export data
pt: Exportar dados

# chuvaExportarDescricao
source: Generate a file with all your records to save or share.
pt: Gere um arquivo com todos os seus registros para guardar ou enviar.

# chuvaImportarDados
source: Import data
pt: Importar dados

# chuvaImportarDescricao
source: Restore records from a backup file.
pt: Restaure registros a partir de um arquivo de backup.

# chuvaExportarSucesso
source: Backup exported successfully!
pt: Backup exportado com sucesso!

# chuvaImportarSucesso
source: {count} records imported!
pt: {count} registros importados!

# chuvaImportarDuplicados
source: {count} records imported ({duplicados} duplicates skipped)
pt: {count} registros importados ({duplicados} duplicados ignorados)

# chuvaErroValorInvalido
source: Enter a value between 0.1 and 500 mm
pt: Digite um valor entre 0.1 e 500 mm

# chuvaErroDataObrigatoria
source: Select a date
pt: Selecione uma data

# chuvaErroArquivoInvalido
source: Invalid backup file
pt: Arquivo de backup inválido

# chuvaIntensidadeLeve
source: Light rain
pt: Chuva leve

# chuvaIntensidadeModerada
source: Moderate rain
pt: Chuva moderada

# chuvaIntensidadeForte
source: Heavy rain
pt: Chuva forte

# chuvaSemRegistrosMes
source: No records this month
pt: Sem registros este mês

# chuvaHoje
source: Today
pt: Hoje

# chuvaOntem
source: Yesterday
pt: Ontem

# chuvaRegistrosEncontrados
source: {count} records found
pt: {count} registros encontrados

# chuvaConfirmarImportacao
source: Import {count} records?
pt: Importar {count} registros?

# chuvaNenhumRegistroBackup
source: No records to export
pt: Nenhum registro para exportar

# chuvaComparacaoMesAcima
source: Above previous month
pt: Acima do mês anterior

# chuvaComparacaoMesAbaixo
source: Below previous month
pt: Abaixo do mês anterior

# chuvaStatsTabOverview
source: Overview
pt: Resumo

# chuvaStatsTabBars
source: Bars
pt: Barras

# chuvaStatsTabCompare
source: Compare
pt: Comparar

# chuvaChartComparativeTitle
source: Year Comparison
pt: Comparativo de Safras

# chuvaShareMessage
source: Rainfall recorded at {propertyName}! 🌧️ #PlanejaCampo
pt: Chuva registrada em {propertyName}! 🌧️ #RuraCamp

# chuvaShareError
source: Error sharing
pt: Erro ao compartilhar

# chuvaWidgetNoData
source: No recent data
pt: Sem dados recentes

# chuvaWidgetUpdatedAt
source: Updated at {time}
pt: Atualizado às {time}

# talhaoTitle
source: Field Plots
pt: Talhões

# talhaoAdd
source: Add Field Plot
pt: Adicionar Talhão

# talhaoEdit
source: Edit Field Plot
pt: Editar Talhão

# talhaoDelete
source: Delete Field Plot
pt: Excluir Talhão

# talhaoName
source: Plot Name
pt: Nome do Talhão

# talhaoNameHint
source: E.g.: Plot A - Soybean
pt: Ex: Talhão A - Soja

# talhaoArea
source: Area (ha)
pt: Área (ha)

# talhaoAreaHint
source: E.g.: 50.5
pt: Ex: 50.5

# talhaoCultura
source: Crop (optional)
pt: Cultura (opcional)

# talhaoCulturaHint
source: E.g.: Soybean, Corn, Coffee
pt: Ex: Soja, Milho, Café

# talhaoListEmpty
source: No field plots registered
pt: Nenhum talhão cadastrado

# talhaoListEmptyDesc
source: Tap + to divide this property into plots
pt: Toque no + para dividir esta propriedade em talhões

# talhaoDeleteConfirm
source: Delete field plot?
pt: Excluir talhão?

# talhaoDeleteConfirmMsg
source: Are you sure you want to delete this field plot?
pt: Tem certeza que deseja excluir este talhão?

# talhaoDeleteWithRecords
source: This field plot has {count} linked record(s). They will be moved to "Whole Property".
pt: Este talhão possui {count} registro(s) vinculado(s). Eles serão movidos para "Propriedade toda".

# talhaoDeleted
source: Field plot deleted
pt: Talhão excluído

# talhaoSaved
source: Field plot saved!
pt: Talhão salvo!

# talhaoUpdated
source: Field plot updated!
pt: Talhão atualizado!

# talhaoNameRequired
source: Enter plot name
pt: Digite o nome do talhão

# talhaoNameTooShort
source: Name too short (minimum 2 characters)
pt: Nome muito curto (mínimo 2 caracteres)

# talhaoNameTooLong
source: Name too long (maximum 50 characters)
pt: Nome muito longo (máximo 50 caracteres)

# talhaoNameExists
source: A field plot with this name already exists in this property
pt: Já existe um talhão com este nome nesta propriedade

# talhaoAreaInvalid
source: Area must be greater than zero
pt: Área deve ser maior que zero

# talhaoAreaExceedsProperty
source: The sum of plot areas ({totalTalhoes} ha) exceeds the property's total area ({propertyArea} ha)
pt: A soma das áreas dos talhões ({totalTalhoes} ha) excede a área total da propriedade ({propertyArea} ha)

# talhaoSelectOptional
source: Field Plot (optional)
pt: Talhão (opcional)

# talhaoWholeProperty
source: Whole Property
pt: Propriedade toda

# talhaoCreateNew
source: + Create new plot
pt: + Criar novo talhão

# talhaoManage
source: Manage Field Plots
pt: Gerenciar Talhões

# talhaoSummaryDivided
source: {dividedArea} ha divided / {totalArea} ha total ({percentage}% divided)
pt: {dividedArea} ha divididos / {totalArea} ha total ({percentage}% dividido)

# talhaoWithRecords
source: {count} record(s)
pt: {count} registro(s)

# talhaoFilterAll
source: All field plots
pt: Todos os talhões

# talhaoFilterBy
source: Filter by field plot
pt: Filtrar por talhão

# talhaoNoSelection
source: No field plot selected
pt: Nenhum talhão selecionado

# deleteDataButton
source: Delete my data
pt: Excluir meus dados

# deleteDataTitle
source: Delete all data?
pt: Excluir todos os dados?

# deleteDataWarning
source: This action is IRREVERSIBLE. All your rainfall records, properties, and settings will be permanently deleted from your device and our servers.
pt: Esta ação é IRREVERSÍVEL. Todos os seus registros de chuva, propriedades e configurações serão permanentemente excluídos do seu dispositivo e dos nossos servidores.

# deleteDataConfirmCheckbox
source: I understand I will lose all my records
pt: Entendo que perderei todos os meus registros

# deleteDataCancel
source: Cancel
pt: Cancelar

# deleteDataConfirm
source: Delete Permanently
pt: Excluir Permanentemente

# deleteDataSuccess
source: Your data has been deleted successfully.
pt: Seus dados foram excluídos com sucesso.

# deleteDataError
source: Error deleting data. Please try again.
pt: Erro ao excluir dados. Tente novamente.

# deleteDataReauthRequired
source: For security, please sign in again before deleting.
pt: Por segurança, faça login novamente antes de excluir.

# exportDataButton
source: Export my data
pt: Exportar meus dados

# exportDataTitle
source: Export data
pt: Exportar dados

# exportDataDescription
source: Download a copy of your data in a standard format to use in other services.
pt: Baixe uma cópia dos seus dados em formato padrão para usar em outros serviços.

# exportDataJson
source: JSON (complete)
pt: JSON (completo)

# exportDataCsv
source: CSV (Excel/Spreadsheets)
pt: CSV (Excel/Planilhas)

# exportDataSuccess
source: Data exported successfully!
pt: Dados exportados com sucesso!

# exportDataError
source: Error exporting data.
pt: Erro ao exportar dados

# revokeAllButton
source: Revoke All and Sign Out
pt: Revogar Tudo e Sair

# revokeAllTitle
source: Revoke all consents?
pt: Revogar todos os consentimentos?

# revokeAllMessage
source: This will remove all your consents and end your session. Your local data will be kept.
pt: Isso removerá todos os seus consentimentos e encerrará a sessão. Seus dados locais serão mantidos.

# alertFrostTitle
source: Frost Risk
pt: Risco de Geada

# alertFrostMessage
source: Temperatures below 3°C. Protect sensitive crops.
pt: Temperaturas abaixo de 3°C. Proteja culturas sensíveis.

# alertHeatWaveTitle
source: Heat Wave
pt: Onda de Calor

# alertHeatWaveMessage
source: Temperatures above 35°C. Monitor hydration and heat stress.
pt: Temperaturas acima de 35°C. Monitore hidratação e estresse térmico.

# alertStormTitle
source: Storm Alert
pt: Alerta de Tempestade
