Repository: PlanejaSafra/PlanejaCampo
Catalog: packages/agro_core/lib/l10n/arb/app_*.arb
Languages: pt

# appName
source: PlanejaCampo
pt: RuraCamp

# continueLabel
source: CONTINUE
pt: CONTINUAR

# acceptAndContinueLabel
source: ACCEPT AND CONTINUE
pt: ACEITAR E CONTINUAR

# acceptAllButton
source: ACCEPT ALL AND CONTINUE
pt: ACEITAR TUDO E CONTINUAR

# confirmSelectionButton
source: CONFIRM AND CONTINUE
pt: CONFIRMAR E CONTINUAR

# declineLabel
source: DECLINE
pt: NÃO ACEITAR

# declineAndExitLabel
source: DECLINE (EXIT)
pt: NÃO ACEITAR (SAIR)

# privacySettingsHint
source: You can review the full documents in Settings → Privacy.
pt: Você pode consultar os documentos completos em Configurações → Privacidade.

# termsTitle
source: Terms of Use and Privacy
pt: Termos de Uso e Privacidade

# termsBodyIntro
source: By tapping "Accept and Continue", you agree to the Terms of Use and Privacy Policy of PlanejaCampo apps.
pt: Ao tocar em "Aceitar e continuar", você concorda com os Termos de Uso e com a Política de Privacidade dos apps RuraCamp.

# termsSummaryTitle
source: Summary of what happens:
pt: Resumo do que acontece:

# termsSummaryItem1
source: This app is a decision support and calculation tool. It provides simulations and estimates based on algorithms that do NOT replace professional evaluation by a technician or agronomist, and the developer is not responsible for any results obtained in the field.
pt: Este app é uma ferramenta de apoio à decisão e cálculo. Ele fornece simulações e estimativas que NÃO substituem a avaliação profissional de um técnico ou agrônomo, e o desenvolvedor não se responsabiliza por quaisquer resultados obtidos no campo.

# termsSummaryItem2
source: By default, your operational data stays on the device (Local Mode). If you choose to enable Backup, Business Network, or Intelligence — even as a guest — your data will be sent to our servers as described in each option.
pt: Por padrão, seus dados operacionais ficam no dispositivo (Modo Local). Se você optar por ativar Backup, Rede de Negócios ou Inteligência — mesmo como visitante — seus dados serão enviados para nossos servidores conforme descrito em cada opção.

# termsSummaryItem3
source: The app may display ads in the free version.
pt: O app pode exibir anúncios na versão gratuita.

# termsFooter
source: You can view the full documents in Settings → Privacy.
pt: Você pode consultar os documentos completos em Configurações → Privacidade.

# termsSection1Title
source: 1. Acceptance of Terms
pt: 1. Aceitação dos Termos

# termsSection1Body
source: By using the PlanejaCampo family of apps (including PlanejaChuva, PlanejaBorracha, PlanejaDiesel, and others), you agree to these Terms of Use. If you do not agree with any part of these terms, you must not use our services.
pt: Ao utilizar os aplicativos da família RuraCamp (incluindo RuraRain, RuraRubber, RuraFuel e outros), você concorda com estes Termos de Uso. Se você não concorda com alguma parte destes termos, não deve utilizar nossos serviços.

# termsSection2Title
source: 2. Service Description
pt: 2. Descrição do Serviço

# termsSection2Body
source: PlanejaCampo apps are agricultural management tools that allow: • Recording and tracking agricultural data (rainfall, production, etc.) • Managing rural properties • Viewing statistics and metrics • Cloud backup and data synchronization (optional) • Sharing aggregated data for research (optional) • Access to Market Intelligence and Business Ecosystem features (optional)
pt: Os aplicativos RuraCamp são ferramentas de gestão agrícola que permitem: • Registro e acompanhamento de dados agrícolas (chuvas, produção, etc.) • Gerenciamento de propriedades rurais • Visualização de estatísticas e métricas • Backup e sincronização de dados na nuvem (opcional) • Compartilhamento de dados agregados para pesquisa (opcional) • Acesso a funcionalidades de Inteligência de Mercado e Ecossistema de Negócios (opcional)

# termsSection3Title
source: 3. User Account
pt: 3. Conta de Usuário

# termsSection3Body
source: You can use our apps in two ways: • Guest Mode (Hybrid): No Google login. By default, your operational data (such as production records, weather, operations, among others) stays on the device. Technical metadata and IDs are sent to servers for security and ads. **If you choose to enable Business Network or Intelligence**, your data will be sent to our servers even without login. • Connected Mode (Google): Unlocks the Full Ecosystem, allowing secure cloud storage, synchronization, data recovery, and easier access to Network and Intelligence features. In both modes, you control which data you share through consent options. You are responsible for maintaining the confidentiality of your account and for all activities that occur under your account.
pt: Você pode utilizar nossos aplicativos de duas formas: • Modo Visitante (Híbrido): Sem login Google. Por padrão, seus dados operacionais (tais como registros de produção, clima, operações, entre outros) ficam no dispositivo. Metadados técnicos e IDs são enviados para servidores para segurança e anúncios. **Se você optar por ativar Rede de Negócios ou Inteligência**, seus dados serão enviados para nossos servidores mesmo sem login. • Modo Conectado (Google): Desbloqueia o Ecossistema Completo, permitindo armazenamento seguro em nuvem, sincronização, recuperação de dados e acesso facilitado a funcionalidades de Rede e Inteligência. Em ambos os modos, você controla quais dados compartilha por meio das opções de consentimento. Você é responsável por manter a confidencialidade de sua conta e por todas as atividades que ocorram sob sua conta.

# termsSection4Title
source: 4. Property and Storage (Hybrid Model)
pt: 4. Propriedade e Armazenamento (Modelo Híbrido)

# termsSection4Body
source: The entered data belongs to you. We use a **Hybrid** architecture: • **Local Base:** Your data stays on the device to ensure offline operation. • **Cloud Sync:** When using connected features (Google Login, Backup, Network), your data is **automatically replicated** on our secure servers (Google Cloud/Firebase). This provides security against device loss and multi-device access. By logging in, you agree to this remote storage of your collections and profile data.
pt: Os dados inseridos pertencem a você. Utilizamos uma arquitetura **Híbrida**: • **Base Local:** Seus dados ficam no dispositivo para garantir funcionamento sem internet. • **Sincronização em Nuvem:** Ao utilizar funcionalidades conectadas (Login Google, Backup, Rede), seus dados são **replicados automaticamente** em nossos servidores seguros (Google Cloud/Firebase). Isso permite segurança contra perda do aparelho e acesso por múltiplos dispositivos. Ao fazer login, você concorda com esse armazenamento remoto das suas coleções e dados de perfil.

# termsSection5Title
source: 5. Acceptable Use
pt: 5. Uso Aceitável

# termsSection5Body
source: By using our services, you agree NOT to: • Violate applicable laws or regulations • Attempt to access or interfere with other users' systems • Use the service for fraudulent or deceptive activities • Overload or damage the service infrastructure • Reverse engineer or attempt to extract source code
pt: Ao usar nossos serviços, você concorda em NÃO: • Violar leis ou regulamentos aplicáveis • Tentar acessar ou interferir com sistemas de outros usuários • Usar o serviço para atividades fraudulentas ou enganosas • Sobrecarregar ou danificar a infraestrutura do serviço • Fazer engenharia reversa ou tentar extrair código-fonte

# termsSection6Title
source: 6. Limitation of Liability (Total Shield)
pt: 6. Limitação de Responsabilidade (Blindagem Total)

# termsSection6Body
source: TOTAL AND COMPREHENSIVE LIABILITY WAIVER: The apps are MATHEMATICAL SIMULATION and CONNECTION tools. They DO NOT replace professional judgment and DO NOT guarantee the integrity of third parties. We are NOT liable, under any circumstances, for: • Crop loss, animal death, or financial losses resulting from management decisions • Calculation, dosage, diagnosis, or weather forecast errors (simulations) • FINANCIAL TRANSACTIONS: Default, fraud, non-payment, chargebacks, or financial crimes (PIX, Wire Transfer) between users • DIGITAL SECURITY: Phishing, password theft, or scams applied by other users via chat or external links • PHYSICAL WORLD EVENTS: Accidents, assaults, or material damage occurring before, during, or after in-person meetings The use of information and the decision to close any deal is the sole and exclusive risk of the user.
pt: ISENÇÃO TOTAL E ABRANGENTE DE RESPONSABILIDADE: Os aplicativos são ferramentas de SIMULAÇÃO MATEMÁTICA e CONEXÃO. Eles NÃO substituem o julgamento profissional e NÃO garantem a idoneidade de terceiros. Nós NÃO nos responsabilizamos, em nenhuma hipótese, por: • Perda de safra, morte de animais ou prejuízos financeiros decorrentes de decisões de manejo • Erros de cálculo, dosagem, diagnóstico ou previsão meteorológica (simulações) • TRANSAÇÕES FINANCEIRAS: Calotes, fraudes, não pagamento, estornos ou crimes financeiros (PIX, TED, Boleto) entre usuários • SEGURANÇA DIGITAL: Phishing, roubo de senhas ou golpes aplicados por outros usuários via chat ou links externos • EVENTOS NO MUNDO FÍSICO: Acidentes, agressões ou danos materiais ocorridos antes, durante ou após encontros presenciais O uso das informações e a decisão de fechar qualquer negócio é de risco exclusivo e integral do usuário.

# termsSection7Title
source: 7. Service Modifications
pt: 7. Modificações do Serviço

# termsSection7Body
source: We reserve the right to: • Modify or discontinue features at any time • Update these Terms of Use • Suspend or terminate accounts that violate terms We will notify you of significant changes through the app.
pt: Reservamos o direito de: • Modificar ou descontinuar recursos a qualquer momento • Atualizar estes Termos de Uso • Suspender ou encerrar contas que violem os termos Notificaremos sobre mudanças significativas através do aplicativo.

# termsSection8Title
source: 8. Intellectual Property
pt: 8. Propriedade Intelectual

# termsSection8Body
source: All content, design, code, and functionality of PlanejaCampo apps are protected by copyright and other intellectual property laws. You may not copy, modify, or distribute our software without authorization.
pt: Todo o conteúdo, design, código e funcionalidades dos aplicativos RuraCamp são protegidos por direitos autorais e outras leis de propriedade intelectual. Você não pode copiar, modificar ou distribuir nosso software sem autorização.

# termsSection9Title
source: 9. Applicable Law
pt: 9. Lei Aplicável

# termsSection9Body
source: These terms are governed by the laws of Brazil. Any disputes will be resolved in the competent courts of Brazil.
pt: Estes termos são regidos pelas leis do Brasil. Quaisquer disputas serão resolvidas nos tribunais competentes do Brasil.

# termsSection10Title
source: 10. Location Collection
pt: 10. Coleta de Localização

# termsSection10Body
source: The app may collect your approximate or precise location (GPS) for specific features, such as weather forecast and regional statistics. By using these features, you authorize the collection and use of this data. You can revoke location access in your device settings at any time.
pt: O aplicativo pode coletar sua localização aproximada ou precisa (GPS) para funcionalidades específicas, como previsão do tempo e estatísticas regionais. Ao utilizar esses recursos, você autoriza a coleta e uso desses dados. Você pode revogar o acesso à localização nas configurações do seu dispositivo a qualquer momento.

# termsSection11Title
source: 11. Contact
pt: 11. Contato

# termsSection11Body
source: For questions about these Terms of Use, contact us via the Settings > About menu in the app.
pt: Para questões sobre estes Termos de Uso, entre em contato através do menu Configurações > Sobre no aplicativo.

# privacyPolicyScreenTitle
source: Privacy Policy
pt: Política de Privacidade

# privacyPolicyTitle
source: Privacy Policy - PlanejaCampo
pt: Política de Privacidade - RuraCamp

# privacyPolicyLastUpdate
source: Last updated: January 2026
pt: Última atualização: Janeiro de 2026

# privacyPolicyFooter
source: © 2026 PlanejaCampo. All rights reserved. This policy complies with LGPD (Law No. 13.709/2018) and GDPR.
pt: © 2026 RuraCamp. Todos os direitos reservados. Esta política está em conformidade com a LGPD (Lei nº 13.709/2018).

# privacySection1Title
source: 1. Introduction
pt: 1. Introdução

# privacySection1Body
source: PlanejaCampo values your privacy and is committed to protecting your personal data. This Privacy Policy explains what data we collect, how we use it, and your rights over it.
pt: A RuraCamp valoriza sua privacidade e está comprometida em proteger seus dados pessoais. Esta Política de Privacidade explica quais dados coletamos, como os usamos e seus direitos sobre eles.

# privacySection2Title
source: 2. Data We Collect
pt: 2. Dados que Coletamos

# privacySection2Body
source: To operate the Digital Ecosystem, we collect: **Account and Profile Data:** • Name, email, phone, and photo (Google login) • Unique user ID and access credentials • Other data you choose to fill in (such as address, bio, qualifications, among others) **Agronomic and Business Data:** • Operational data (such as inventory, rainfall, production, livestock, tasks, among others) • Offers and transactions (such as purchases, sales, services, ads, among others) • Property location (GPS) and geographic data **Technical and Behavioral Data:** • Device information (such as model, IP, operating system, among others) • App interactions and usage (such as clicks, navigation, time spent, among others)
pt: Para operar o Ecossistema Digital, coletamos: **Dados de Conta e Perfil:** • Nome, email, telefone e foto (login Google) • ID único de usuário e credenciais de acesso • Outros dados que você optar por preencher (tais como endereço, bio, qualificações, entre outros) **Dados Agronômicos e de Negócios:** • Dados operacionais (tais como inventário, chuvas, produção, rebanho, tarefas, entre outros) • Ofertas e transações (tais como compras, vendas, serviços, anúncios, entre outros) • Localização das propriedades (GPS) e dados geográficos **Dados Técnicos e de Comportamento:** • Informações do dispositivo (tais como modelo, IP, sistema operacional, entre outros) • Interações e uso do app (tais como cliques, navegação, tempo de uso, entre outros)

# privacySection3Title
source: 3. Commercial Use and Intelligence (Business Model)
pt: 3. Uso Comercial e Inteligência (Modelo de Negócio)

# privacySection3Body
source: By using the app for free, you agree that we sustain the platform through: **1. Market Intelligence Generation:** By enabling the Intelligence option, you authorize the processing of your data — in identified, anonymized, or aggregated form — to create reports, statistics, indices, and intelligence products that may be used internally or commercialized with partners. **2. Business Connections (Matchmaking):** By enabling the Business Network, you authorize the use of your profile, contact, and offer data to connect you with potential buyers, sellers, or service providers. **3. Service Improvement:** To enhance weather forecasting algorithms, pest diagnosis, management recommendations, and other features.
pt: Ao utilizar o aplicativo gratuitamente, você concorda que sustentamos a plataforma através de: **1. Geração de Inteligência de Mercado:** Ao ativar a opção de Inteligência, você autoriza o processamento dos seus dados — de forma identificada, anonimizada ou agregada — para criar relatórios, estatísticas, índices e produtos de inteligência que podem ser utilizados internamente ou comercializados com parceiros. **2. Conexão de Negócios (Matchmaking):** Ao ativar a Rede de Negócios, você autoriza o uso dos seus dados de perfil, contato e ofertas para conectá-lo a potenciais compradores, vendedores ou prestadores de serviço. **3. Melhoria do Serviço:** Para aprimorar algoritmos de previsão climática, diagnóstico de pragas, recomendações de manejo e outras funcionalidades.

# privacySection4Title
source: 4. Data Sharing
pt: 4. Compartilhamento de Dados

# privacySection4Body
source: Your data may be shared in the following situations, according to the consents you enable: **Business Network:** • By enabling, you authorize the sharing of profile, contact, offer data, and other data necessary for the operation of the platform and its partners **Agronomic Intelligence:** • By enabling, you authorize the use of your data (in identified, anonymized, or aggregated form) for market intelligence, research, and commercial partnerships **Legal and Technical Operators:** • To comply with court orders or prevent fraud • With infrastructure providers (such as Google Cloud, Firebase, among others) under confidentiality agreements
pt: Seus dados podem ser compartilhados nas seguintes situações, conforme os consentimentos que você ativar: **Rede de Negócios:** • Ao ativar, você autoriza o compartilhamento de dados de perfil, contato, ofertas e outros dados necessários para o funcionamento da plataforma e de seus parceiros **Inteligência Agronômica:** • Ao ativar, você autoriza o uso dos seus dados (de forma identificada, anonimizada ou agregada) para inteligência de mercado, pesquisa e parcerias comerciais **Operadores Legais e Técnicos:** • Para cumprir ordens judiciais ou prevenir fraudes • Com provedores de infraestrutura (tais como Google Cloud, Firebase, entre outros) sob contrato de sigilo

# privacySection5Title
source: 5. Storage and International Transfer
pt: 5. Armazenamento e Transferência Internacional

# privacySection5Body
source: Your data may be stored and processed in Brazil or any other country where we or our partners maintain servers. **Guest Mode (No Login):** By default, operational data stays on the device. Technical metadata (IP, logs) may be sent to servers. If you enable Network or Intelligence options, your data will be sent even without login. **Connected Mode:** Data is synced to the cloud for backup and multi-device access, protected by encryption in transit and at rest.
pt: Seus dados podem ser armazenados e processados no Brasil ou em qualquer outro país onde nós ou nossos parceiros mantenham servidores. **Modo Visitante (Sem Login):** Por padrão, dados operacionais ficam no dispositivo. Metadados técnicos (IP, logs) podem ser enviados para servidores. Se você ativar opções de Rede ou Inteligência, seus dados serão enviados mesmo sem login. **Modo Conectado:** Dados são sincronizados na nuvem para backup e acesso multidispositivo, protegidos por criptografia em trânsito e repouso.

# privacySection6Title
source: 6. User Rights
pt: 6. Direitos do Usuário

# privacySection6Body
source: You maintain control over your direct personal data (Name/Email) and can request deletion or portability at any time. Data already processed, anonymized, or aggregated in intelligence reports cannot be removed, as it is no longer personal.
pt: Você mantém controle sobre seus dados pessoais diretos (Nome/Email) e pode solicitar exclusão ou portabilidade a qualquer momento. Dados já processados, anonimizados ou agregados em relatórios de inteligência não podem ser removidos, pois deixaram de ser pessoais.

# privacySection7Title
source: 7. Specific Terms (Comprehensive Shield)
pt: 7. Termos Específicos (Blindagem Ampla)

# privacySection7Body
source: By enabling specific features, you agree to extended terms: **7.1. Business Network:** You authorize the sending, storage, processing, and sharing of all data necessary for the operation of the platform and its partners. The platform does not moderate content in advance and is not responsible for negotiations. **7.2. Agronomic Intelligence:** You grant a perpetual and irrevocable license to send, store, process, aggregate, analyze, and share your data — in identified, anonymized, or aggregated form — for market intelligence, research, commercial partnerships, and service improvement purposes.
pt: Ao ativar funcionalidades específicas, você concorda com termos estendidos: **7.1. Rede de Negócios:** Você autoriza o envio, armazenamento, processamento e compartilhamento de todos os dados necessários para o funcionamento da plataforma e de seus parceiros. A plataforma não modera antecipadamente o conteúdo e não se responsabiliza por negociações. **7.2. Inteligência Agronômica:** Você concede licença perpétua e irrevogável para envio, armazenamento, processamento, agregação, análise e compartilhamento dos seus dados — de forma identificada, anonimizada ou agregada — para fins de inteligência de mercado, pesquisa, parcerias comerciais e melhoria dos serviços.

# privacySection8Title
source: 8. Security
pt: 8. Segurança

# privacySection8Body
source: We use industry-standard encryption and secure authentication. You are responsible for protecting your access credentials.
pt: Utilizamos criptografia padrão de mercado e autenticação segura. Você é responsável por proteger suas credenciais de acesso.

# privacySection9Title
source: 9. Professional Use and Age Restriction
pt: 9. Uso Profissional e Restrição de Idade

# privacySection9Body
source: This app is intended exclusively for PROFESSIONAL USE by rural producers, technicians, and agricultural workers. Use by minors under 18 is not permitted. We do not intentionally collect data from children. If we identify a minor's account, it will be terminated.
pt: Este aplicativo é destinado exclusivamente a USO PROFISSIONAL por produtores rurais, técnicos e trabalhadores do setor agropecuário. Não é permitido o uso por menores de 18 anos. Não coletamos intencionalmente dados de crianças. Se identificarmos uma conta de menor, ela será encerrada.

# privacySection10Title
source: 10. Changes
pt: 10. Alterações

# privacySection10Body
source: We may change this policy at any time to reflect new business models. Continued use of the app implies acceptance of changes.
pt: Podemos alterar esta política a qualquer momento para refletir novos modelos de negócio. O uso continuado do app implica aceitação das mudanças.

# privacySection11Title
source: 11. Storage Technologies
pt: 11. Tecnologias de Armazenamento

# privacySection11Body
source: We use secure local databases and caching technologies to ensure offline-first operation.
pt: Utilizamos bancos de dados locais seguros e tecnologias de cache para garantir o funcionamento offline-first.

# privacySection12Title
source: 12. Contact
pt: 12. Contato

# privacySection12Body
source: Questions? Go to Settings > About.
pt: Dúvidas? Acesse Configurações > Sobre.

# consentTitle
source: Privacy Configuration
pt: Configuração de Privacidade

# consentIntro
source: Choose how PlanejaCampo should work for you:
pt: Escolha como o RuraCamp deve funcionar para você:

# consentOption1Title
source: Cloud Backup & Sync
pt: Backup e Sincronização em Nuvem

# consentOption1Desc
source: Save data to the cloud for security and team access.
pt: Salvar dados na nuvem para segurança e acesso em equipe.

# consentOption1Legal
source: By activating this (available only with Google login), your data (such as production records, inventory, tasks, and other operational data) will be sent to our secure servers and linked to your account. This allows you to recover everything if you lose your phone and enables authorized collaborators to access the same data. This data is NOT made public.
pt: Ao ativar (disponível apenas com login Google), seus dados (tais como registros de produção, estoque, tarefas, e outros dados operacionais) serão enviados para nossos servidores seguros e vinculados à sua conta. Isso permite recuperar tudo caso perca o celular e possibilita que colaboradores autorizados por você acessem os mesmos dados. Esses dados NÃO são tornados públicos.

# consentOption2Title
source: Business Network & Opportunities
pt: Rede de Negócios e Oportunidades
