Repository: PlanejaSafra/PlanejaCampo
Catalog: apps/rurarubber/lib/l10n/arb/app_*.arb
Languages: pt

# parceirosTitle
source: Partners
pt: Parceiros

# parceirosEmpty
source: No partners registered yet.
pt: Nenhum parceiro cadastrado ainda.

# parceiroNome
source: Partner Name
pt: Nome do Parceiro

# parceiroPercentual
source: Percentage (%)
pt: Percentual (%)

# parceiroTelefone
source: Phone (optional)
pt: Telefone (opcional)

# parceiroDeleteTitle
source: Delete Partner?
pt: Excluir Parceiro?

# parceiroDeleteMessage
source: Do you really want to delete this partner? This action cannot be undone.
pt: Deseja realmente excluir este parceiro? Esta ação não pode ser desfeita.

# parceiroDeleteConfirm
source: Delete
pt: Excluir

# parceiroDeleteCancel
source: Cancel
pt: Cancelar

# parceiroNomeRequired
source: Name is required
pt: Nome é obrigatório

# parceiroPercentualInvalid
source: Invalid percentage (0-100)
pt: Percentual inválido (0-100)

# parceiroSaveButton
source: Save Partner
pt: Salvar Parceiro

# parceiroAddButton
source: Add Partner
pt: Adicionar Parceiro

# parceiroEditButton
source: Edit Partner
pt: Editar Parceiro

# pesagemTitle
source: Weighing
pt: Pesagem

# pesagemSelectPartner
source: Select a Partner
pt: Selecione um Parceiro

# pesagemCurrentWeight
source: Current Weight
pt: Peso Atual

# pesagemTotalAccumulated
source: Total Accumulated
pt: Total Acumulado

# pesagemFinishPartner
source: Finish Partner
pt: Concluir Parceiro

# pesagemNoPartnersError
source: No partners registered. Register one first.
pt: Nenhum parceiro cadastrado. Cadastre um primeiro.

# pesagemCalculatorLabel
source: Calculator
pt: Calculadora

# tapeViewTitle
source: Adding Tape
pt: Fita de Somar

# tapeViewEmpty
source: No weighings yet
pt: Nenhuma pesagem ainda

# tapeViewUndo
source: Undo
pt: Desfazer

# fechamentoTitle
source: Delivery Closing
pt: Fechamento de Entrega

# fechamentoBasePrice
source: Base Price (R$/kg)
pt: Preço Base (R$/kg)

# fechamentoPriceRequired
source: Enter the sale price
pt: Informe o preço de venda

# fechamentoPriceInvalid
source: Price must be greater than zero
pt: Preço deve ser maior que zero

# fechamentoPartner
source: Partner
pt: Parceiro

# fechamentoWeight
source: Weight (kg)
pt: Peso (kg)

# fechamentoPercentage
source: Percentage
pt: Percentual

# fechamentoValue
source: Value (R$)
pt: Valor (R$)

# fechamentoTotalWeight
source: Total Weight
pt: Peso Total

# fechamentoTotalSale
source: Total Sale
pt: Venda Total

# fechamentoGeneratePdf
source: Generate Receipt (PDF)
pt: Gerar Recibo (PDF)

# fechamentoNoItems
source: No items to close
pt: Nenhum item para fechar

# listaEntregasTitle
source: Delivery History
pt: Histórico de Entregas

# listaEntregasEmpty
source: No deliveries recorded
pt: Nenhuma entrega registrada

# listaEntregasDate
source: Date
pt: Data

# listaEntregasWeight
source: Weight
pt: Peso

# listaEntregasValue
source: Value
pt: Valor

# listaEntregasStatusOpen
source: Open
pt: Aberto

# listaEntregasStatusClosed
source: Closed
pt: Fechado

# listaEntregasStatusPaid
source: Paid
pt: Pago

# listaEntregasResume
source: Resume
pt: Retomar

# listaEntregasClose
source: Close
pt: Fechar

# listaEntregasDelete
source: Delete
pt: Excluir

# listaEntregasDeleteConfirm
source: Do you want to delete this delivery?
pt: Deseja excluir esta entrega?

# mercadoTitle
source: The Market
pt: O Mercado

# mercadoFilterLabel
source: Filtering by property location
pt: Filtrando por localização da propriedade

# mercadoChangeLocation
source: Change
pt: Alterar

# mercadoNoOffers
source: No offers available for your region at the moment.
pt: Nenhuma oferta disponível para sua região no momento.

# mercadoCheckLater
source: Check again later or adjust your search radius.
pt: Verifique novamente mais tarde ou ajuste seu raio de busca.

# notificationsComingSoon
source: Offer notifications coming soon!
pt: Notificações de ofertas em desenvolvimento. Volte em breve!

# mercadoNotifyButton
source: Notify me when available
pt: Avise-me quando chegar

# mercadoOfferValidUntil
source: Valid until
pt: Válido até

# mercadoOfferPrice
source: Price
pt: Preço

# mercadoOfferWet
source: Wet
pt: Úmido

# mercadoOfferConditions
source: Conditions
pt: Condições

# mercadoOfferInterested
source: I'm Interested
pt: Tenho Interesse

# mercadoFabSnackbar
source: Buyer features coming soon
pt: Funcionalidade para Compradores em breve

# mercadoBuyerRole
source: Buyer
pt: Comprador

# criarOfertaTitle
source: Create Offer
pt: Criar Oferta

# criarOfertaTitleField
source: Offer Title
pt: Título da Oferta

# criarOfertaTitleRequired
source: Title is required
pt: Título é obrigatório

# criarOfertaPriceDrc
source: DRC Price (R$/kg)
pt: Preço DRC (R$/kg)

# criarOfertaPriceDrcInvalid
source: Invalid DRC price
pt: Preço DRC inválido

# criarOfertaPriceWet
source: Wet/Banca Price (R$/kg)
pt: Preço Úmido/Banca (R$/kg)

# criarOfertaPriceWetInvalid
source: Invalid wet price
pt: Preço Úmido inválido

# criarOfertaConditions
source: Payment Conditions
pt: Condições de Pagamento

# criarOfertaConditionsHint
source: E.g.: Cash, 30 days, payment on delivery...
pt: Ex: À vista, 30 dias, pagamento na entrega...

# criarOfertaPhone
source: Contact Phone
pt: Telefone para Contato

# criarOfertaPhoneRequired
source: Phone is required
pt: Telefone é obrigatório

# criarOfertaPublishButton
source: Publish Offer
pt: Publicar Oferta

# criarOfertaPublishing
source: Publishing...
pt: Publicando...

# criarOfertaSuccess
source: Offer published successfully!
pt: Oferta publicada com sucesso!

# criarOfertaError
source: Error publishing offer
pt: Erro ao publicar oferta

# calculatorAdd
source: ADD WEIGHT
pt: ADICIONAR PESO

# drawerParceiros
source: Partners
pt: Parceiros

# drawerPesagem
source: Weighing
pt: Pesagem

# drawerMercado
source: The Market
pt: O Mercado

# drawerEntregas
source: History
pt: Histórico

# unknownPartner
source: Unknown
pt: Desconhecido

source: partners attended
pt: parceiros atendidos

# errorLabel
source: Error
pt: Erro

# profileSelectionTitle
source: Who are you?
pt: Quem é você?

# profileSelectionSubtitle
source: Select your profile to personalize your experience
pt: Selecione seu perfil para personalizar sua experiência

# profileProdutor
source: I'm a Producer
pt: Sou Produtor

# profileProdutorDesc
source: I manage plantations and partners
pt: Gerencio seringais e parceiros

# profileComprador
source: I'm a Buyer
pt: Sou Comprador

# profileCompradorDesc
source: I buy rubber from producers
pt: Compro borracha de produtores

# profileSangrador
source: I'm a Tapper
pt: Sou Sangrador

# profileSangradorDesc
source: I collect latex and weigh rubber
pt: Coleto látex e faço pesagens

# profileContinue
source: Continue
pt: Continuar

# profileSelectOne
source: Select a profile to continue
pt: Selecione um perfil para continuar

# homeTitle
source: Home
pt: Início

# homeWelcome
source: Hello, {name}!
pt: Olá, {name}!

# homeWelcomeGeneric
source: Welcome to RuraRubber!
pt: Bem-vindo ao RuraRubber!

# homeQuickActions
source: Quick Actions
pt: Ações Rápidas

# homeNewWeighing
source: New Weighing
pt: Nova Pesagem

# homeNewWeighingDesc
source: Start today's weighing
pt: Iniciar romaneio do dia

# homeViewPartners
source: Partners
pt: Parceiros

# homeViewPartnersDesc
source: Manage tappers
pt: Gerenciar sangradores

# homeViewHistory
source: History
pt: Histórico

# homeViewHistoryDesc
source: View past deliveries
pt: Ver entregas anteriores

# homeViewMarket
source: Market
pt: Mercado

# homeViewMarketDesc
source: View purchase offers
pt: Ver ofertas de compra

# homeSummaryTitle
source: Monthly Summary
pt: Resumo do Mês

# homeSummaryDeliveries
source: Deliveries
pt: Entregas

# homeSummaryTotalWeight
source: Total Weight
pt: Peso Total

# homeSummaryTotalValue
source: Total Value
pt: Valor Total

# homeSummaryNoData
source: No deliveries this month
pt: Nenhuma entrega este mês

# homeRecentDeliveries
source: Recent Deliveries
pt: Entregas Recentes

# homeNoRecentDeliveries
source: No recent deliveries
pt: Nenhuma entrega recente

# homeViewAllDeliveries
source: View all
pt: Ver todas

# homeMarketOffers
source: Market Offers
pt: Ofertas do Mercado

# homeNoMarketOffers
source: No offers available
pt: Nenhuma oferta disponível

# homeViewAllOffers
source: View all
pt: Ver todas

# homeMyOffers
source: My Offers
pt: Minhas Ofertas

# homeNoMyOffers
source: You haven't published any offers yet
pt: Você ainda não publicou ofertas

# homeCreateOffer
source: Create Offer
pt: Criar Oferta

# homeConfigureSeringal
source: Configure your Work Site (Seringal) to see the forecast.
pt: Configure seu Seringal (Local de Trabalho) para ver a previsão.

# homeConfigureProperty
source: Configure your property to see the weather forecast.
pt: Configure sua propriedade para ver a previsão do tempo.

# homeBtnConfigureSeringal
source: Configure Site
pt: Configurar Seringal

# homeBtnConfigure
source: Configure
pt: Configurar

# aboutDialogDescription
source: Manage your deliveries and track rubber production.
pt: Gerencie suas entregas e acompanhe a produção de borracha.

# marketLocationFilterTitle
source: Location Filter
pt: Filtro de Localização

# marketLocationFilterMessage
source: The location filter is based on your main registered property. To change it, go to Settings > Properties and update your location.
pt: O filtro de localização é baseado na propriedade principal cadastrada. Para alterar, vá em Configurações > Propriedades e atualize sua localização.

# marketWhatsappMessage
source: Hello, I saw your offer on RuraRubber ({buyerName}). I have production in {region}.
pt: Olá, vi sua oferta no RuraRubber ({buyerName}). Tenho produção em {region}.

# drawerHome
source: Home
pt: Início

# shareTitle
source: Share Weight
pt: Compartilhar Peso

# shareAsImage
source: Image
pt: Imagem

# shareAsText
source: Text
pt: Texto

# shareWeightButton
source: Share
pt: Compartilhar

# shareWeightSuccess
source: Shared successfully!
pt: Compartilhado com sucesso!

# shareWeightError
source: Error sharing
pt: Erro ao compartilhar

# mercadoTabBuy
source: Buy Offers
pt: Compras

# mercadoTabSell
source: Sell Offers
pt: Vendas

# mercadoNoSellOffers
source: No sell offers available at the moment.
pt: Nenhuma oferta de venda disponível no momento.

# mercadoSellerRole
source: Seller
pt: Vendedor

# mercadoAvailable
source: available
pt: disponível

# mercadoPriceNegotiable
source: Price negotiable
pt: Preço a combinar

# mercadoExpiringDays
source: {days, plural, =0{Expires today} =1{Expires tomorrow} other{Expires in {days} days}}
pt: {days, plural, =0{Vence hoje} =1{Vence amanhã} other{Vence em {days} dias}}

# marketWhatsappMessageSell
source: Hello, I saw your sell offer on RuraRubber ({sellerName}). I'm interested and located in {region}.
pt: Olá, vi sua oferta de venda no RuraRubber ({sellerName}). Tenho interesse e estou na região de {region}.

# criarOfertaTypeLabel
source: Offer Type
pt: Tipo de Oferta

# criarOfertaTypeBuy
source: I want to Buy
pt: Quero Comprar

# criarOfertaTypeSell
source: I want to Sell
pt: Quero Vender

# criarOfertaAvailableKg
source: Available Quantity (kg)
pt: Quantidade Disponível (kg)

# criarOfertaAvailableKgHint
source: E.g.: 500
pt: Ex: 500

# criarOfertaAvailableKgInvalid
source: Invalid quantity
pt: Quantidade inválida

# criarOfertaPriceOptional
source: Price (optional - leave empty for 'negotiable')
pt: Preço (opcional - deixe vazio para 'a combinar')

# criarOfertaValidityDays
source: Validity (days)
pt: Validade (dias)

# criarOfertaValidityDaysHint
source: E.g.: 7, 14, 30
pt: Ex: 7, 14, 30

# criarOfertaValidityInvalid
source: Invalid validity (1-90 days)
pt: Validade inválida (1-90 dias)

# criarOfertaNameLabel
source: Your Name / Company Name
pt: Seu Nome / Nome da Empresa

# criarOfertaNameRequired
source: Name is required
pt: Nome é obrigatório

# criarOfertaMunicipality
source: Municipality
pt: Município

# criarOfertaMunicipalityHint
source: E.g.: São José do Rio Preto
pt: Ex: São José do Rio Preto

# criarOfertaTreesInTapping
source: Trees in Tapping
pt: Árvores em Sangria

# criarOfertaTreesInTappingHint
source: E.g.: 5000
pt: Ex: 5000

# criarOfertaTreesInTappingInvalid
source: Invalid quantity
pt: Quantidade inválida

# criarOfertaEstimatedWeight
source: Estimated Weight (kg)
pt: Peso Estimado (kg)

# criarOfertaEstimatedWeightHint
source: E.g.: 2000
pt: Ex: 2000

# criarOfertaProductionDetails
source: Production Details
pt: Detalhes da Produção

# mercadoTreesLabel
source: trees in tapping
pt: árvores em sangria

# mercadoEstimatedLabel
source: estimated
pt: estimado

# jobsTitle
source: Jobs & Availability
pt: Vagas e Disponibilidade

# jobsTabOffering
source: Job Offers
pt: Vagas

# jobsTabSeeking
source: Available
pt: Disponíveis

# jobsCreateButton
source: Create Post
pt: Criar Anúncio

# jobsNoOffering
source: No job offers posted yet. Be the first to post!
pt: Nenhuma vaga publicada no momento. Seja o primeiro a anunciar!

# jobsNoSeeking
source: No tappers available at the moment. Check back later!
pt: Nenhum sangrador disponível no momento. Volte mais tarde!

# jobsRoleProducer
source: Producer
pt: Produtor

# jobsRoleTapper
source: Tapper
pt: Sangrador

# jobsPercentageLabel
source: offered
pt: oferecido

# jobsContactButton
source: Contact
pt: Entrar em Contato

# jobsWhatsappMessageOffering
source: Hello {userName}, I saw your job offer on RuraRubber. I'm in the {region} region and I'm interested!
pt: Olá {userName}, vi sua vaga no RuraRubber. Estou na região de {region} e tenho interesse!

# jobsWhatsappMessageSeeking
source: Hello {userName}, I saw your availability on RuraRubber. I have a plantation in the {region} region and would like to talk!
pt: Olá {userName}, vi sua disponibilidade no RuraRubber. Tenho um seringal na região de {region} e gostaria de conversar!

# criarVagaTitle
source: Create Post
pt: Criar Anúncio

# criarVagaTypeLabel
source: Post Type
pt: Tipo de Anúncio

# criarVagaTypeOffering
source: Offering Work
pt: Ofereço Trabalho

# criarVagaTypeOfferingDesc
source: I'm a producer looking for a tapper
pt: Sou produtor e preciso de sangrador

# criarVagaTypeSeeking
source: Seeking Work
pt: Procuro Trabalho

# criarVagaTypeSeekingDesc
source: I'm a tapper and available
pt: Sou sangrador e estou disponível

# criarVagaNameLabel
source: Your Name
pt: Seu Nome

# criarVagaNameRequired
source: Name is required
pt: Nome é obrigatório

# criarVagaPhoneLabel
source: Contact Phone
pt: Telefone para Contato

# criarVagaPhoneRequired
source: Phone is required
pt: Telefone é obrigatório

# criarVagaMunicipalityLabel
source: Municipality
pt: Município

# criarVagaMunicipalityHint
source: E.g.: São José do Rio Preto
pt: Ex: São José do Rio Preto

# criarVagaDescriptionLabel
source: Description
pt: Descrição

# criarVagaDescriptionHint
source: Describe job details or your experience...
pt: Descreva detalhes da vaga ou sua experiência...

# criarVagaDescriptionRequired
source: Description is required
pt: Descrição é obrigatória

# criarVagaPercentageLabel
source: Offered Percentage (%)
pt: Percentual Oferecido (%)

# criarVagaPercentageHint
source: E.g.: 50
pt: Ex: 50

# criarVagaTreesLabel
source: Trees in Tapping
pt: Árvores em Sangria

# criarVagaTreesHint
source: E.g.: 5000
pt: Ex: 5000

# criarVagaValidityLabel
source: Validity (days)
pt: Validade (dias)

# criarVagaValidityHint
source: E.g.: 30
pt: Ex: 30

# criarVagaValidityInvalid
source: Invalid validity (1-90 days)
pt: Validade inválida (1-90 dias)

# criarVagaPublishButton
source: Publish Post
pt: Publicar Anúncio

# criarVagaPublishing
source: Publishing...
pt: Publicando...

# criarVagaSuccess
source: Post published successfully!
pt: Anúncio publicado com sucesso!

# criarVagaError
source: Error publishing post
pt: Erro ao publicar anúncio

# criarVagaJobDetails
source: Job Details
pt: Detalhes da Vaga
